app/controllers/posts_controller.rb

  def index
    @page = params.fetch(:page,0).to_i
    @posts = Post.offset(@page * POSTS_PER_PAGE).limit(POSTS_PER_PAGE)
---
SELECT "posts".* FROM "posts" LIMIT $1 OFFSET $2  [["LIMIT", 18], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "posts" LIMIT $1 OFFSET $2) subquery_for_count  [["LIMIT", 18], ["OFFSET", 0]]

  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "a"], ["body", "a"], ["created_at", "2022-03-31 15:52:05.493167"], ["updated_at", "2022-03-31 15:52:05.493167"], ["user_id", 2]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Sam "], ["updated_at", "2022-03-24 16:52:58.483199"], ["id", 1]]