app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "zanluka.hojnik11@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def self.from_omniauth(access_token)
    data = access_token.info
    user = User.where(email: data['email']).first
     unless user
         user = User.create(
            email: data['email'],
            password: Devise.friendly_token[0,20]
         )

SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "zanluka.hojnik11@gmail.com"], ["LIMIT", 1]]
---
def self.from_omniauth(auth)
  name_split = auth.info.name.split(" ")
  user = User.where(email: auth.info.email).first